---
type: FabricationUtils
namespace: Autodesk.Revit.DB.Fabrication
version: 2024
members: 2
tags: [revit-api, class]
---

# FabricationUtils

`Autodesk.Revit.DB.Fabrication.FabricationUtils` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ExportToPCF | 2018 | `public static void ExportToPCF ( Document document , IList < ElementId > ids , string filename )` |
| Method | ValidateConnectivity | 2016 | `public static bool ValidateConnectivity ( Document document , Connector connector1 , Connector connector2 )` |